# Imports Libraries

In [4]:
import pandas as pd

# Exercise 1

1. Inner Join: Join employees.csv with salaries.csv on EmployeeID to get the salary details for each employee.

In [5]:
df_departments = pd.read_csv('datasets/departments.csv')
df_employees = pd.read_csv('datasets/employees.csv')
df_locations = pd.read_csv('datasets/locations.csv')
df_projects = pd.read_csv('datasets/projects.csv')
df_salaries = pd.read_csv('datasets/salaries.csv')

In [6]:
# df_employees.join(df_salaries, on='EmployeeID', how='inner', lsuffix='_emp', rsuffix='_sal')
print(pd.merge(df_employees, df_salaries, on=["EmployeeID", "Salary"], how="inner"))

   EmployeeID       Name   Department  Salary  Bonus
0           1       John  Engineering   55000   5000
1           2       Anna    Marketing   46000   3000
2           3      Peter  Engineering   60000   7000
3           4      Linda           HR   75000   8000
4           5      James    Marketing   49000   2000
5           6   Patricia  Engineering   52000   4000
6           7    Michael           HR   82000  10000
7           8  Elizabeth  Engineering   67000   6000
8           9      David    Marketing   43000   1500
9          10      Susan           HR   90000  12000

2. Left Join: Join employees.csv with departments.csv on Department to get the department manager for each employee.

In [7]:
print(pd.merge(df_employees, df_departments, on="Department", how="left"))

   EmployeeID       Name   Department  Salary  DepartmentID        Manager
0           1       John  Engineering   55000             1       John Doe
1           2       Anna    Marketing   46000             2     Jane Smith
2           3      Peter  Engineering   60000             1       John Doe
3           4      Linda           HR   75000             3  Michael Brown
4           5      James    Marketing   49000             2     Jane Smith
5           6   Patricia  Engineering   52000             1       John Doe
6           7    Michael           HR   82000             3  Michael Brown
7           8  Elizabeth  Engineering   67000             1       John Doe
8           9      David    Marketing   43000             2     Jane Smith
9          10      Susan           HR   90000             3  Michael Brown

3. Right Join: Join employees.csv with projects.csv on EmployeeID to get the projects assigned to employees, including those with no project.

In [8]:
print(pd.merge(df_employees, df_projects, on="EmployeeID", how='right'))

   EmployeeID       Name   Department  Salary  ProjectID      ProjectName
0           1       John  Engineering   55000        101    Project Alpha
1           2       Anna    Marketing   46000        102     Project Beta
2           3      Peter  Engineering   60000        103    Project Gamma
3           4      Linda           HR   75000        104    Project Delta
4           5      James    Marketing   49000        105  Project Epsilon
5           6   Patricia  Engineering   52000        106     Project Zeta
6           7    Michael           HR   82000        107      Project Eta
7           8  Elizabeth  Engineering   67000        108    Project Theta
8           9      David    Marketing   43000        109     Project Iota
9          10      Susan           HR   90000        110    Project Kappa

4. Full Outer Join: Join salaries.csv with locations.csv on EmployeeID to get salary and location for all employees, even if some information is missing in one of the tables.

In [9]:
print(pd.merge(df_salaries, df_locations, on="EmployeeID", how='outer'))

   EmployeeID  Salary  Bonus       Location
0           1   55000   5000       New York
1           2   46000   3000  San Francisco
2           3   60000   7000         Boston
3           4   75000   8000        Chicago
4           5   49000   2000    Los Angeles
5           6   52000   4000         Austin
6           7   82000  10000          Miami
7           8   67000   6000         Dallas
8           9   43000   1500        Seattle
9          10   90000  12000         Denver

5. Self Join: Join employees.csv with itself based on Department to get the list of employees in the same department as a specific employee.

In [10]:
# self join to find colleagues in the same department
# Merge df_employees with itself to find colleagues in the same department
merged_df = pd.merge(df_employees, df_employees, on="Department", suffixes=('', '_colleague'))

# Filter out rows where EmployeeID is the same for both employees
same_dept = merged_df[merged_df['EmployeeID'] != merged_df['EmployeeID_colleague']]

# filter to find colleagues of a specific employee (e.g., EmployeeID = 1)
john_colleagues = same_dept[same_dept['EmployeeID'] == 1]

# Select relevant columns to display
colleagues = john_colleagues[['EmployeeID', 'Name', 'Department', 'EmployeeID_colleague', 'Name_colleague', 'Salary_colleague']]
print(colleagues)

   EmployeeID  Name   Department  EmployeeID_colleague Name_colleague  \
1           1  John  Engineering                     3          Peter
2           1  John  Engineering                     6       Patricia
3           1  John  Engineering                     8      Elizabeth

   Salary_colleague
1             60000
2             52000
3             67000

# Exercise 2

1. Load a CSV file into a pandas DataFrame.

In [11]:
df_departments = pd.read_csv('datasets/departments.csv')
df_employees = pd.read_csv('datasets/employees.csv')
df_locations = pd.read_csv('datasets/locations.csv')
df_projects = pd.read_csv('datasets/projects.csv')
df_salaries = pd.read_csv('datasets/salaries.csv')

2. Check the first 5 rows of the DataFrame.

In [12]:
df_employees.head(5)

   EmployeeID   Name   Department  Salary
0           1   John  Engineering   55000
1           2   Anna    Marketing   46000
2           3  Peter  Engineering   60000
3           4  Linda           HR   75000
4           5  James    Marketing   49000

3. Get the shape of the DataFrame (rows, columns).

In [13]:
df_employees.shape

(10, 4)

 
4. Get summary statistics (mean, median, mode, std) of numerical columns.

In [14]:
print("Mean of Employee Data is: ",df_employees['Salary'].mean())
print("Median of Employee Data is: ",df_employees['Salary'].median())
print("Mode of Employee Data is: ",df_employees['Salary'].mode())
print("STD Mode of Employee Data is: ",df_employees['Salary'].std())

Mean of Employee Data is:  61900.0
Median of Employee Data is:  57500.0
Mode of Employee Data is:  0    43000
1    46000
2    49000
3    52000
4    55000
5    60000
6    67000
7    75000
8    82000
9    90000
Name: Salary, dtype: int64
STD Mode of Employee Data is:  16044.729144904048

In [15]:
# df_employees.describe()
df_employees['Salary'].describe()

count       10.000000
mean     61900.000000
std      16044.729145
min      43000.000000
25%      49750.000000
50%      57500.000000
75%      73000.000000
max      90000.000000
Name: Salary, dtype: float64

5. Get the data types of each column.

In [16]:
# print("EmployeeID data type is: ",df_employees['EmployeeID'].dtype)
print("Employee Dataset each column data type:")
df_employees.dtypes

Employee Dataset each column data type:

EmployeeID     int64
Name          object
Department    object
Salary         int64
dtype: object

6. Check for missing values in each column.

In [17]:
df_employees.isnull().sum()

EmployeeID    0
Name          0
Department    0
Salary        0
dtype: int64

7. Rename a column in the DataFrame.

In [18]:
# first paramenter is the dictionary, where the keys are the old column names and the values are the new column names 
# The inplace parameter can be set to True to modify the DataFrame directly, or False (default) to return a new DataFrame with the renamed columns. 
# df_employees.rename(columns={'EmployeeID': 'Employee_ID', 'Department': 'dept'}, inplace=True)
df_employees.rename(columns={'EmployeeID': 'Employee_ID'}, inplace=True)
df_employees

   Employee_ID       Name   Department  Salary
0            1       John  Engineering   55000
1            2       Anna    Marketing   46000
2            3      Peter  Engineering   60000
3            4      Linda           HR   75000
4            5      James    Marketing   49000
5            6   Patricia  Engineering   52000
6            7    Michael           HR   82000
7            8  Elizabeth  Engineering   67000
8            9      David    Marketing   43000
9           10      Susan           HR   90000

8. Filter the DataFrame to get rows where a column value is greater than a certain number. 

    There are multiple way to filter the dataframe:
- Boolean indexing -> Logical Operators (AND & , OR | , NOT ~ )
- .loc Accessor
- .isin()
- .query()

        I. Boolean Indexing -> Filtering using boolean indexing is done by creating a boolean series based on a condition and using it to select rows. Ideal for simple conditions (e.g., df[column] > value) filtering rows based on conditions applied to individual columns.

In [19]:
# single condition
# df_employees[df_employees['Salary'] >= 75000]
df_employees[df_employees['Salary'] > 75000]

   Employee_ID     Name Department  Salary
6            7  Michael         HR   82000
9           10    Susan         HR   90000

In [20]:
# multiple conditions
# df_employees[(df_employees['Salary'] > 50000) & (df_employees['Department'] == 'Engineering')]
# df_employees[(df_employees['Salary'] > 50000) | (df_employees['Department'] == 'HR')]
df_employees[~(df_employees['Salary'] > 50000)]

   Employee_ID   Name Department  Salary
1            2   Anna  Marketing   46000
4            5  James  Marketing   49000
8            9  David  Marketing   43000

        II. The '.loc[]' accessor allows filtering based on labels (row names or column names). When we need to filter both rows and columns simultaneously. Apply conditions to rows and select specific columns.

In [21]:
df_employees.loc[df_employees['Salary'] > 67000, ['Department', 'Salary']]

  Department  Salary
3         HR   75000
6         HR   82000
9         HR   90000

        III. The '.isin()' is useful when you want to filter rows based on whether a column’s value exists in a list of values. Best when checking if a column’s value is in a list of specific values. Use when filtering rows based on membership in a list, series, or array.

In [22]:
df_employees[df_employees['Salary'].isin([60000, 90000])]

   Employee_ID   Name   Department  Salary
2            3  Peter  Engineering   60000
9           10  Susan           HR   90000

        IV. The .query() method allows filtering using a string-based query, similar to SQL. Ideal for complex conditions written in a SQL-like syntax.

In [23]:
df_employees.query('Salary > 60000 and Department == "Engineering"')

   Employee_ID       Name   Department  Salary
7            8  Elizabeth  Engineering   67000

9. Select specific columns from the DataFrame.

In [24]:
df_employees[['Name','Department']]

        Name   Department
0       John  Engineering
1       Anna    Marketing
2      Peter  Engineering
3      Linda           HR
4      James    Marketing
5   Patricia  Engineering
6    Michael           HR
7  Elizabeth  Engineering
8      David    Marketing
9      Susan           HR

10. Drop a column from the DataFrame.

In [25]:
# Drop a single column
# df_employees.drop('Department', axis=1)

# Drop multiple columns
df_employees.drop(['Department', 'Employee_ID'], axis=1)

        Name  Salary
0       John   55000
1       Anna   46000
2      Peter   60000
3      Linda   75000
4      James   49000
5   Patricia   52000
6    Michael   82000
7  Elizabeth   67000
8      David   43000
9      Susan   90000

11. Apply a transformation to a column (e.g., multiply each value by 2).

In [26]:
# df_employees['Salary'] = df_employees['Salary'] * 2
df_employees['Salary'] = df_employees['Salary'].apply(lambda x: x * 2)
df_employees

   Employee_ID       Name   Department  Salary
0            1       John  Engineering  110000
1            2       Anna    Marketing   92000
2            3      Peter  Engineering  120000
3            4      Linda           HR  150000
4            5      James    Marketing   98000
5            6   Patricia  Engineering  104000
6            7    Michael           HR  164000
7            8  Elizabeth  Engineering  134000
8            9      David    Marketing   86000
9           10      Susan           HR  180000

12. Add a new column based on an operation on existing columns.

In [27]:
df_employees.loc[df_employees['Department'] == 'HR', 'Bonus'] = df_employees['Salary'] * 0.05
df_employees.loc[df_employees['Department'] == 'Marketing', 'Bonus'] = df_employees['Salary'] * 0.08
df_employees.loc[df_employees['Department'] == 'Engineering', 'Bonus'] = df_employees['Salary'] * 0.1

df_employees

   Employee_ID       Name   Department  Salary    Bonus
0            1       John  Engineering  110000  11000.0
1            2       Anna    Marketing   92000   7360.0
2            3      Peter  Engineering  120000  12000.0
3            4      Linda           HR  150000   7500.0
4            5      James    Marketing   98000   7840.0
5            6   Patricia  Engineering  104000  10400.0
6            7    Michael           HR  164000   8200.0
7            8  Elizabeth  Engineering  134000  13400.0
8            9      David    Marketing   86000   6880.0
9           10      Susan           HR  180000   9000.0

13. Group the data by a categorical column and get the mean of each group.

In [28]:
df_employees.groupby('Department')['Salary'].mean()

Department
Engineering    117000.000000
HR             164666.666667
Marketing       92000.000000
Name: Salary, dtype: float64

14. Sort the DataFrame based on a specific column.

In [29]:
df_employees.sort_values(by='Department')

   Employee_ID       Name   Department  Salary    Bonus
0            1       John  Engineering  110000  11000.0
2            3      Peter  Engineering  120000  12000.0
5            6   Patricia  Engineering  104000  10400.0
7            8  Elizabeth  Engineering  134000  13400.0
3            4      Linda           HR  150000   7500.0
6            7    Michael           HR  164000   8200.0
9           10      Susan           HR  180000   9000.0
1            2       Anna    Marketing   92000   7360.0
4            5      James    Marketing   98000   7840.0
8            9      David    Marketing   86000   6880.0

15. Merge two DataFrames on a common column.

In [30]:
# renamed column name because to merge other dataframe
df_employees.rename(columns={'Employee_ID': 'EmployeeID'}, inplace=True)

df_employees_locations = pd.merge(df_employees, df_locations, on='EmployeeID')
df_employees_locations

   EmployeeID       Name   Department  Salary    Bonus       Location
0           1       John  Engineering  110000  11000.0       New York
1           2       Anna    Marketing   92000   7360.0  San Francisco
2           3      Peter  Engineering  120000  12000.0         Boston
3           4      Linda           HR  150000   7500.0        Chicago
4           5      James    Marketing   98000   7840.0    Los Angeles
5           6   Patricia  Engineering  104000  10400.0         Austin
6           7    Michael           HR  164000   8200.0          Miami
7           8  Elizabeth  Engineering  134000  13400.0         Dallas
8           9      David    Marketing   86000   6880.0        Seattle
9          10      Susan           HR  180000   9000.0         Denver

16. Join two DataFrames using an index.

In [31]:

# print(pd.merge(df_employees, df_departments, how='left', left_index=True, right_index=True))
# print(df_employees.join(df_departments, lsuffix="_emp", rsuffix="_dept"))
print(pd.concat([df_employees, df_departments], axis=1))

   EmployeeID       Name   Department  Salary    Bonus  DepartmentID  \
0           1       John  Engineering  110000  11000.0           1.0
1           2       Anna    Marketing   92000   7360.0           2.0
2           3      Peter  Engineering  120000  12000.0           3.0
3           4      Linda           HR  150000   7500.0           NaN
4           5      James    Marketing   98000   7840.0           NaN
5           6   Patricia  Engineering  104000  10400.0           NaN
6           7    Michael           HR  164000   8200.0           NaN
7           8  Elizabeth  Engineering  134000  13400.0           NaN
8           9      David    Marketing   86000   6880.0           NaN
9          10      Susan           HR  180000   9000.0           NaN

    Department        Manager
0  Engineering       John Doe
1    Marketing     Jane Smith
2           HR  Michael Brown
3          NaN            NaN
4          NaN            NaN
5          NaN            NaN
6          NaN            NaN
7          NaN            NaN
8          NaN            NaN
9          NaN            NaN

17. Apply a function to each element in a column using .apply().

In [32]:
df_employees['Salary'] = df_employees['Salary'].apply(lambda x: x * 2)
df_employees

   EmployeeID       Name   Department  Salary    Bonus
0           1       John  Engineering  220000  11000.0
1           2       Anna    Marketing  184000   7360.0
2           3      Peter  Engineering  240000  12000.0
3           4      Linda           HR  300000   7500.0
4           5      James    Marketing  196000   7840.0
5           6   Patricia  Engineering  208000  10400.0
6           7    Michael           HR  328000   8200.0
7           8  Elizabeth  Engineering  268000  13400.0
8           9      David    Marketing  172000   6880.0
9          10      Susan           HR  360000   9000.0

18. Create a new DataFrame by filtering rows based on multiple conditions.

In [33]:
filtered_df = df_employees[(df_employees["Salary"] > 200000) & (df_employees['Bonus'] < 10000)]
filtered_df

   EmployeeID     Name Department  Salary   Bonus
3           4    Linda         HR  300000  7500.0
6           7  Michael         HR  328000  8200.0
9          10    Susan         HR  360000  9000.0

19. Convert a column from string to a numeric type.

In [34]:
df_employees.dtypes

EmployeeID      int64
Name           object
Department     object
Salary          int64
Bonus         float64
dtype: object

In [35]:
# First convert the column to string because there is no numeric value string column to convert to int
df_employees['Salary'] = df_employees['Salary'].astype(str)
df_employees.dtypes

EmployeeID      int64
Name           object
Department     object
Salary         object
Bonus         float64
dtype: object

In [36]:
# here we are converting the string column to int
df_employees['Salary'] = df_employees['Salary'].astype(int)
df_employees.dtypes

EmployeeID      int64
Name           object
Department     object
Salary          int64
Bonus         float64
dtype: object

20. Save the modified DataFrame to a new CSV file.

In [37]:
# index=False prevents the DataFrame index from being written to the CSV file. 
filtered_df.to_csv('datasets/filtered_employees.csv', sep=',', index=False, header=True)